// 목재총량(TUKorea, 백준, 누적합, DP)
// http://210.93.60.51/problem/0044

#include <iostream>
#include <vector>

using namespace std;

int main(void)
{
	int M, N;
	cin >> M >> N;

	vector<vector<int>> arr(M, vector<int>(N, 0));

	// 2차원 배열 입력
	for (int i = 0; i < M; ++i)
	{
		for (int j = 0; j < N; ++j)
		{
			cin >> arr[i][j];
		}
	}

	vector<vector<int>> dp(M + 1, vector<int>(N + 1, 0));

	// 누적합 = dp
	// R = [][]: MxN 2차원 목재 배열
	// dp[r][c]: (0, 0)에서 (r, c)까지 직사각형 토지의 목재 총량
	// 점화식 dp[r][c] = dp[r][c-1] + dp[r-1][c] - dp[r-1][c-1] + R[r][c]
	// (0, 0)-----------------------------------------
	// |---------------|--------------------|---------
	// |-----------(r-1, c-1)--------------(r-1, c)---
	// |-----------(r, c-1)----------------(r, c)-----
	
	for (int r = 1; r < M + 1; ++r)
	{
		for (int c = 1; c < N+1; ++c)
		{
			dp[r][c] = dp[r][c - 1] + dp[r - 1][c] - dp[r - 1][c - 1] + arr[r - 1][c - 1];
		}
	}

	// 계산해야 하는 토지의 개수
	int C;
	cin >> C;

	// (r1, c1):(r2, c2) 직사각형 부분합
	// 부분합 = dp[r2][c2] - dp[r2][c1-1] - dp[r1-1][c2] + dp[r1-1][c1-1] 
	
	// ----------------------------------------
 	//         |                          |
	// ---(r1-1, c1-1)---------------(r1-1, c2)
	// --------|--------(r1, c1)----------|
	// --------|-----------|--------------|
	// ----(r2, c1-1)------|-----------(r2,c2)
	for (int i = 0; i < C; ++i)
	{
		int r1, c1, r2, c2;
		cin >> r1 >> c1 >> r2 >> c2;

		cout << dp[r2][c2] - dp[r2][c1 - 1] - dp[r1 - 1][c2] + dp[r1 - 1][c1 - 1] << endl;
	}
}